cpereir89/esp32_wirelesslab/WirelessLab_ESP32/WirelessLab_ESP32.ino
#include <Arduino.h>
#include <esp_arduino_version.h>
#include <vector>
#include <WiFi.h>
#include <WebServer.h>
#include <DNSServer.h>

#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEScan.h>
#include <BLEAdvertisedDevice.h>
#include <BLEAdvertising.h>
#include <BLEServer.h>
#include <BLEService.h>
#include <BLECharacteristic.h>
#include <BLE2902.h>

extern "C" {
  #include "esp_wifi.h"
}

// ============================================================
// WirelessLab32 v0.4.2
// Target: ESP32 clásico / ESP32-D0WD-V3
//
// Wi-Fi:
// - AP scan
// - Beacon lab limitado
// - Portal cautivo educativo
//
// BLE:
// - Control únicamente por Serial
// - Escaneo
// - Listado
// - Advertising BLE estable
//
// El portal es exclusivamente de laboratorio y no persiste datos.
// No almacena información en flash ni SD.
// ============================================================

static const char *FW_VERSION = "0.4.2";

// Credenciales exclusivas del laboratorio.
static const char *DEMO_USERNAME = "student";

// Nombre BLE fijo para la prueba estable.
static const char *BLE_DEVICE_NAME = "WirelessLab32";

// Servicio BLE de demostración.
static const char *BLE_SERVICE_UUID =
  "12345678-1234-1234-1234-1234567890ab";

// Datos exclusivamente ficticios para la simulación BlueSnarf.
static const char *BLE_DEMO_CONTACT_1_UUID =
  "12345678-1234-1234-1234-1234567890ac";

static const char *BLE_DEMO_CONTACT_2_UUID =
  "12345678-1234-1234-1234-1234567890ad";

static const char *BLE_DEMO_CONTACT_3_UUID =
  "12345678-1234-1234-1234-1234567890ae";

static const char *BLE_BLUEJACK_MESSAGE_UUID =
  "12345678-1234-1234-1234-1234567890af";

static const char *BLE_DEMO_CONTACTS[] = {
  "BEGIN:VCARD\nFN:Alex Example\nTEL:+1-555-0100\nEMAIL:alex@example.invalid\nEND:VCARD",
  "BEGIN:VCARD\nFN:Sam Student\nTEL:+1-555-0101\nEMAIL:sam@example.invalid\nEND:VCARD",
  "BEGIN:VCARD\nFN:Taylor Teacher\nTEL:+1-555-0102\nEMAIL:taylor@example.invalid\nEND:VCARD"
};

static const uint8_t MAX_BEACON_SSIDS = 5;

// Límite duro editable. Siempre se puede detener antes con: stop
static const uint8_t MAX_WIFI_SPAM_DURATION_SECONDS = 60;

// Advertising BLE genérico; se detiene antes con: ble spam stop
static const uint8_t MAX_BLE_SPAM_DURATION_SECONDS = 60;

struct BleSpamPreset {
  const char *name;
  const char *message;
};

// Presets ficticios. No usar nombres, IDs ni payloads de marcas reales.
static const BleSpamPreset BLE_SPAM_PRESETS[] = {
  {"Lab Beacon Alpha", "WirelessLab32 classroom payload A"},
  {"Lab Beacon Bravo", "WirelessLab32 classroom payload B"},
  {"Lab Beacon Charlie", "WirelessLab32 classroom payload C"}
};

static const size_t BLE_SPAM_PRESET_COUNT =
  sizeof(BLE_SPAM_PRESETS) / sizeof(BLE_SPAM_PRESETS[0]);

static const uint32_t BLE_SPAM_ROTATION_INTERVAL_MS = 3000;

// ============================================================
// Wi-Fi spam lab presets
// Edita estos nombres para preparar la práctica (máximo 5).
// Cada SSID debe contener entre 1 y 32 caracteres.
// ============================================================

static const char *WIFI_SPAM_SSIDS[] = {
  "Pizza Gratis!",
  "Dennys Ultra Mega Free Wifi",
  "Red Corporativa InGen"
};

static const size_t WIFI_SPAM_SSID_COUNT =
  sizeof(WIFI_SPAM_SSIDS) / sizeof(WIFI_SPAM_SSIDS[0]);

static_assert(
  WIFI_SPAM_SSID_COUNT <= MAX_BEACON_SSIDS,
  "WIFI_SPAM_SSIDS cannot contain more than 5 entries"
);

// ============================================================
// Modos
// ============================================================

enum class Mode {
  IDLE,
  WIFI_SCAN,
  BEACON_LAB,
  PORTAL,
  BLE_SERIAL
};

Mode currentMode = Mode::IDLE;

// ============================================================
// Servicios generales
// ============================================================

WebServer webServer(80);
DNSServer dnsServer;

String serialBuffer;

bool portalActive = false;

// ============================================================
// Wi-Fi scan
// ============================================================

struct AccessPointInfo {
  String ssid;
  String bssid;
  int32_t rssi;
  int32_t channel;
};

std::vector<AccessPointInfo> accessPoints;

// ============================================================
// Beacon lab
// ============================================================

std::vector<String> beaconSsids;

uint8_t beaconChannel = 6;
uint32_t beaconStopAt = 0;
uint16_t beaconSequence = 0;

// ============================================================
// BLE
// ============================================================

struct BleDeviceInfo {
  String address;
  String name;
  String serviceUuid;
  String manufacturerData;
  int rssi;
};

std::vector<BleDeviceInfo> bleDevices;

BLEScan *bleScan = nullptr;
BLEAdvertising *bleAdvertising = nullptr;
BLEServer *bleServer = nullptr;
BLEService *bleService = nullptr;
BLECharacteristic *bleDemoContacts[3] = {nullptr, nullptr, nullptr};
BLECharacteristic *bleBluejackMessage = nullptr;

bool bleInitialized = false;
bool bleAdvertisingActive = false;
uint32_t bleAdvertisingStopAt = 0;
uint32_t bleSpamNextRotationAt = 0;
size_t bleSpamPresetIndex = 0;
bool bleSpamActive = false;
bool portalRoutesConfigured = false;

// ============================================================
// Forward declarations
// ============================================================

void stopBleOperations();
void stopAll();

// ============================================================
// Helpers
// ============================================================

String getModeName() {
  switch (currentMode) {
    case Mode::IDLE:
      return "IDLE";

    case Mode::WIFI_SCAN:
      return "WIFI_SCAN";

    case Mode::BEACON_LAB:
      return "BEACON_LAB";

    case Mode::PORTAL:
      return "PORTAL";

    case Mode::BLE_SERIAL:
      return "BLE_SERIAL";
  }

  return "UNKNOWN";
}

void printPrompt() {
  Serial.print("> ");
}

String bytesToHex(
  const uint8_t *data,
  size_t length
) {
  static const char *HEX_DIGITS = "0123456789ABCDEF";

  String output;
  output.reserve(length * 2);

