cpereir89/esp32_wirelesslab/WirelessLab_ESP32/WirelessLab_ESP32.ino
  for (size_t i = 0; i < length; i++) {
    output += HEX_DIGITS[(data[i] >> 4) & 0x0F];
    output += HEX_DIGITS[data[i] & 0x0F];
  }

  return output;
}

// ============================================================
// BLE callbacks
// ============================================================

class WirelessLabBleCallbacks
  : public BLEAdvertisedDeviceCallbacks {

public:

  void onResult(
    BLEAdvertisedDevice device
  ) override {
    BleDeviceInfo result;

    result.address =
      device.getAddress().toString().c_str();

    result.rssi =
      device.getRSSI();

    if (device.haveName()) {
      result.name =
        device.getName().c_str();
    }

    if (device.haveServiceUUID()) {
      result.serviceUuid =
        device.getServiceUUID().toString().c_str();
    }

    if (device.haveManufacturerData()) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
      String manufacturerData =
        device.getManufacturerData();

      result.manufacturerData =
        bytesToHex(
          reinterpret_cast<const uint8_t *>(
            manufacturerData.c_str()
          ),
          manufacturerData.length()
        );
#else
      std::string manufacturerData =
        device.getManufacturerData();

      result.manufacturerData =
        bytesToHex(
          reinterpret_cast<const uint8_t *>(
            manufacturerData.data()
          ),
          manufacturerData.size()
        );
#endif
    }

    // Actualizar un dispositivo existente.
    for (BleDeviceInfo &existing : bleDevices) {
      if (existing.address == result.address) {
        existing = result;
        return;
      }
    }

    // Evitar crecimiento ilimitado.
    if (bleDevices.size() < 100) {
      bleDevices.push_back(result);
    }
  }
};

WirelessLabBleCallbacks bleCallbacks;

// ============================================================
// BLE initialization
// ============================================================

void initializeBle() {
  if (bleInitialized) {
    return;
  }

  Serial.println("Initializing BLE stack...");

  BLEDevice::init(BLE_DEVICE_NAME);

  // Scanner BLE.
  bleScan =
    BLEDevice::getScan();

  bleScan->setAdvertisedDeviceCallbacks(
    &bleCallbacks,
    true
  );

  bleScan->setActiveScan(true);
  bleScan->setInterval(100);
  bleScan->setWindow(80);

  // Servidor y servicio mínimos para advertising estable.
  bleServer =
    BLEDevice::createServer();

  bleService =
    bleServer->createService(
      BLE_SERVICE_UUID
    );

  bleDemoContacts[0] =
    bleService->createCharacteristic(
      BLE_DEMO_CONTACT_1_UUID,
      BLECharacteristic::PROPERTY_READ
    );

  bleDemoContacts[1] =
    bleService->createCharacteristic(
      BLE_DEMO_CONTACT_2_UUID,
      BLECharacteristic::PROPERTY_READ
    );

  bleDemoContacts[2] =
    bleService->createCharacteristic(
      BLE_DEMO_CONTACT_3_UUID,
      BLECharacteristic::PROPERTY_READ
    );

  for (size_t i = 0; i < 3; i++) {
    bleDemoContacts[i]->setValue(BLE_DEMO_CONTACTS[i]);
  }

  bleBluejackMessage =
    bleService->createCharacteristic(
      BLE_BLUEJACK_MESSAGE_UUID,
      BLECharacteristic::PROPERTY_READ |
      BLECharacteristic::PROPERTY_NOTIFY
    );

  bleBluejackMessage->addDescriptor(new BLE2902());
  bleBluejackMessage->setValue("WirelessLab32 classroom message");

  bleService->start();

  bleAdvertising =
    BLEDevice::getAdvertising();

  /*
    Primera fase de estabilidad: anunciar solo el nombre que
    BLEDevice configura en el objeto global. El servicio GATT
    existe y puede descubrirse al conectar, pero su UUID de
    128 bits aún no se agrega al paquete legacy de 31 bytes.

    Nombre + UUID de 128 bits + flags + TX power no caben juntos
    en esos 31 bytes. El UUID se incorporará en una fase separada.
  */
  bleAdvertising->setScanResponse(false);

  bleInitialized = true;

  Serial.println("BLE stack initialized.");
}

// ============================================================
// BLE operations
// ============================================================

void stopBleScan() {
  if (bleScan != nullptr) {
    bleScan->stop();
  }
}

void stopBleAdvertising() {
  if (
    bleAdvertising != nullptr &&
    bleAdvertisingActive
  ) {
    bleAdvertising->stop();
    delay(100);

    Serial.println(
      "BLE advertising stopped."
    );
  }

  bleAdvertisingActive = false;
  bleAdvertisingStopAt = 0;
  bleSpamNextRotationAt = 0;
  bleSpamPresetIndex = 0;
  bleSpamActive = false;
}

void stopBleOperations() {
  stopBleScan();
  stopBleAdvertising();
}

void enterBleSerialMode() {
  /*
    No llamamos stopAll() aquí después de inicializar BLE,
    porque stopAll() también apaga Wi-Fi y puede interferir
    con operaciones previamente inicializadas.

    Primero detenemos los servicios Wi-Fi.
  */

  dnsServer.stop();
  webServer.stop();

  WiFi.softAPdisconnect(true);
  // Apagar la radio sin borrar las credenciales guardadas en NVS.
  WiFi.disconnect(true, false);
  WiFi.mode(WIFI_OFF);

  portalActive = false;
  beaconStopAt = 0;

  currentMode = Mode::BLE_SERIAL;

  initializeBle();

  Serial.println();
  Serial.println("BLE serial mode ready.");
  Serial.println("Commands:");
  Serial.println("  ble scan");
  Serial.println("  ble list");
  Serial.println("  ble advertise start");
  Serial.println("  ble advertise stop");
  Serial.println("  ble exit");
}

void runBleScan() {
  if (currentMode != Mode::BLE_SERIAL) {
    enterBleSerialMode();
  }

  initializeBle();

  stopBleAdvertising();
  stopBleScan();

  bleDevices.clear();
  bleScan->clearResults();

  Serial.println(
    "Scanning BLE devices for 8 seconds..."
  );

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  BLEScanResults *results =
    bleScan->start(
      8,
      false
    );

  if (results != nullptr) {
    Serial.printf(
      "Raw BLE advertisements found: %d\n",
      results->getCount()
    );
  } else {
    Serial.println(
      "BLE scan finished without a results object."
    );
  }
#else
  BLEScanResults results =
    bleScan->start(
      8,
      false
    );

  Serial.printf(
    "Raw BLE advertisements found: %d\n",
    results.getCount()
  );
#endif

  Serial.printf(
    "Unique devices stored: %u\n",
    static_cast<unsigned>(
      bleDevices.size()
    )
  );

  bleScan->clearResults();
}

void printBleDevices() {
  if (bleDevices.empty()) {
    Serial.println(
      "No stored BLE scan results."
    );

    return;
  }

  Serial.println();
  Serial.println(
    "IDX  RSSI  ADDRESS            NAME"
  );

  Serial.println(
    "--------------------------------------------------------------------------"
  );

  for (size_t i = 0; i < bleDevices.size(); i++) {
    const BleDeviceInfo &device =
      bleDevices[i];

    Serial.printf(
      "%3u  %4d  %-17s  %s\n",
      static_cast<unsigned>(i),
      device.rssi,
      device.address.c_str(),
      device.name.length()
        ? device.name.c_str()
        : "<unnamed>"
    );

    if (device.serviceUuid.length()) {
      Serial.printf(
        "                         UUID: %s\n",
        device.serviceUuid.c_str()
      );
    }

    if (device.manufacturerData.length()) {
      Serial.printf(
        "                         MFG : %s\n",
        device.manufacturerData.c_str()
      );
    }
  }
}

