cpereir89/esp32_wirelesslab/WirelessLab_ESP32/WirelessLab_ESP32.ino
void startBleAdvertising() {
  if (currentMode != Mode::BLE_SERIAL) {
    enterBleSerialMode();
  }

  initializeBle();

  stopBleScan();
  stopBleAdvertising();

  Serial.println(
    "Starting stable BLE advertising..."
  );

  /*
    Esta implementación utiliza el objeto global de advertising
    creado durante initializeBle().

    No crea objetos BLEAdvertisementData locales.
    No usa manufacturer data.
    No usa scan response personalizado.
    No cambia dinámicamente el nombre.
  */

  bleAdvertising->start();

  bleAdvertisingActive = true;
  bleAdvertisingStopAt = 0;

  Serial.println(
    "BLE advertising started."
  );

  Serial.printf(
    "Name: %s\n",
    BLE_DEVICE_NAME
  );

  Serial.printf(
    "GATT Service UUID: %s (not in advertising packet)\n",
    BLE_SERVICE_UUID
  );
}

void publishBleSpamPreset() {
  if (BLE_SPAM_PRESET_COUNT == 0 || bleBluejackMessage == nullptr) {
    return;
  }

  const BleSpamPreset &preset =
    BLE_SPAM_PRESETS[bleSpamPresetIndex];

  String payload = String(preset.name) + ": " + preset.message;
  bleBluejackMessage->setValue(payload.c_str());
  bleBluejackMessage->notify();

  Serial.printf(
    "[BLE SPAM LAB] Preset %u/%u: %s\n",
    static_cast<unsigned>(bleSpamPresetIndex + 1),
    static_cast<unsigned>(BLE_SPAM_PRESET_COUNT),
    preset.name
  );

  bleSpamPresetIndex =
    (bleSpamPresetIndex + 1) % BLE_SPAM_PRESET_COUNT;
}

void printBleSpamPresets() {
  Serial.println("BLE spam lab presets:");

  for (size_t i = 0; i < BLE_SPAM_PRESET_COUNT; i++) {
    Serial.printf(
      "  %u: %s -> %s\n",
      static_cast<unsigned>(i + 1),
      BLE_SPAM_PRESETS[i].name,
      BLE_SPAM_PRESETS[i].message
    );
  }
}

void startBleSpamLab(uint8_t seconds) {
  if (seconds == 0 || seconds > MAX_BLE_SPAM_DURATION_SECONDS) {
    seconds = MAX_BLE_SPAM_DURATION_SECONDS;
  }

  startBleAdvertising();

  bleAdvertisingStopAt =
    millis() + static_cast<uint32_t>(seconds) * 1000UL;

  bleSpamActive = true;
  bleSpamPresetIndex = 0;
  publishBleSpamPreset();
  bleSpamNextRotationAt = millis() + BLE_SPAM_ROTATION_INTERVAL_MS;

  Serial.println();
  Serial.println("BLE advertising lab started.");
  Serial.println("Generic educational payload only; no branded pop-up payloads.");
  Serial.printf("Preset rotation: %lu ms\n", BLE_SPAM_ROTATION_INTERVAL_MS);
  Serial.printf("Duration: %u seconds\n", seconds);
}

void serviceBleAdvertisingLab() {
  if (!bleAdvertisingActive || bleAdvertisingStopAt == 0) {
    return;
  }

  if (
    bleSpamActive &&
    static_cast<int32_t>(millis() - bleSpamNextRotationAt) >= 0
  ) {
    publishBleSpamPreset();
    bleSpamNextRotationAt = millis() + BLE_SPAM_ROTATION_INTERVAL_MS;
  }

  if (
    static_cast<int32_t>(millis() - bleAdvertisingStopAt) >= 0
  ) {
    Serial.println();
    Serial.println("BLE advertising lab timeout reached.");
    stopBleAdvertising();
    printPrompt();
  }
}

void startBlueSnarfDemo() {
  startBleAdvertising();

  Serial.println();
  Serial.println("BlueSnarf safe simulation ready.");
  Serial.println("This ESP32 is the intentionally vulnerable device.");
  Serial.println("All exposed contact data is fictional.");
  Serial.println("Contact characteristics:");
  Serial.printf("  1: %s\n", BLE_DEMO_CONTACT_1_UUID);
  Serial.printf("  2: %s\n", BLE_DEMO_CONTACT_2_UUID);
  Serial.printf("  3: %s\n", BLE_DEMO_CONTACT_3_UUID);
  Serial.println("Connect with nRF Connect and read each vCard.");
}

void startBluejackingDemo() {
  startBleAdvertising();

  Serial.println();
  Serial.println("Bluejacking safe BLE simulation ready.");
  Serial.println("Connect with nRF Connect and enable notifications on:");
  Serial.println(BLE_BLUEJACK_MESSAGE_UUID);
  Serial.println("Then use: ble bluejack send <message>");
}

void sendBluejackDemoMessage(String message) {
  message.trim();

  if (message.length() == 0 || message.length() > 80) {
    Serial.println("Message must contain between 1 and 80 characters.");
    return;
  }

  initializeBle();
  bleBluejackMessage->setValue(message.c_str());
  bleBluejackMessage->notify();

  Serial.printf("[BLUEJACK LAB] Notification: %s\n", message.c_str());
  Serial.println("Delivered only to connected clients that opted into notifications.");
}

// ============================================================
// Wi-Fi stop helpers
// ============================================================

void stopPortal() {
  dnsServer.stop();
  webServer.stop();

  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_OFF);

  portalActive = false;
}

void stopAll() {
  stopPortal();
  stopBleOperations();

  beaconStopAt = 0;

  WiFi.disconnect(true, false);
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_OFF);

  currentMode = Mode::IDLE;

  Serial.println(
    "Stopped. Mode: IDLE"
  );
}

// ============================================================
// Wi-Fi AP scan
// ============================================================

void runWifiScan() {
  stopAll();

  currentMode = Mode::WIFI_SCAN;

  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, false);

  delay(150);

  Serial.println(
    "Scanning Wi-Fi access points..."
  );

  int networkCount =
    WiFi.scanNetworks(
      false,
      true
    );

  accessPoints.clear();

  if (networkCount <= 0) {
    Serial.println(
      "No access points found."
    );
  } else {
    accessPoints.reserve(networkCount);

    for (int i = 0; i < networkCount; i++) {
      AccessPointInfo accessPoint;

      accessPoint.ssid =
        WiFi.SSID(i);

      accessPoint.bssid =
        WiFi.BSSIDstr(i);

      accessPoint.rssi =
        WiFi.RSSI(i);

      accessPoint.channel =
        WiFi.channel(i);

      accessPoints.push_back(
        accessPoint
      );
    }

    Serial.printf(
      "Found %d access point(s).\n",
      networkCount
    );

    Serial.println(
      "Use: wifi list"
    );
  }

  WiFi.scanDelete();
  WiFi.mode(WIFI_OFF);

  currentMode = Mode::IDLE;
}

void printWifiList() {
  if (accessPoints.empty()) {
    Serial.println(
      "No stored Wi-Fi scan results."
    );

    return;
  }

  Serial.println();
  Serial.println(
    "IDX  CH   RSSI  BSSID              SSID"
  );

  Serial.println(
    "----------------------------------------------------------"
  );

  for (size_t i = 0; i < accessPoints.size(); i++) {
    const AccessPointInfo &accessPoint =
      accessPoints[i];

    Serial.printf(
      "%3u  %2ld  %4ld  %-17s  %s\n",
      static_cast<unsigned>(i),
      static_cast<long>(
        accessPoint.channel
      ),
      static_cast<long>(
        accessPoint.rssi
      ),
      accessPoint.bssid.c_str(),
      accessPoint.ssid.length()
        ? accessPoint.ssid.c_str()
        : "<hidden>"
    );
  }
}

