cpereir89/esp32_wirelesslab/WirelessLab_ESP32/WirelessLab_ESP32.ino
// ============================================================
// Beacon lab
// ============================================================

void sendBeaconFrame(
  const String &ssid
) {
  if (
    ssid.length() == 0 ||
    ssid.length() > 32
  ) {
    return;
  }

  uint8_t frame[128] = {0};
  size_t position = 0;

  const uint8_t header[] = {
    0x80, 0x00,
    0x00, 0x00,

    0xff, 0xff, 0xff,
    0xff, 0xff, 0xff,

    0x02, 0x00, 0x00,
    0x00, 0x00, 0x01,

    0x02, 0x00, 0x00,
    0x00, 0x00, 0x01,

    0x00, 0x00
  };

  memcpy(
    frame + position,
    header,
    sizeof(header)
  );

  position += sizeof(header);

  frame[22] =
    static_cast<uint8_t>(
      (beaconSequence & 0x0F) << 4
    );

  frame[23] =
    static_cast<uint8_t>(
      (beaconSequence >> 4) & 0xFF
    );

  beaconSequence++;

  // Timestamp.
  memset(
    frame + position,
    0,
    8
  );

  position += 8;

  // Beacon interval.
  frame[position++] = 0x64;
  frame[position++] = 0x00;

  // Capability information.
  frame[position++] = 0x01;
  frame[position++] = 0x04;

  // SSID element.
  frame[position++] = 0x00;

  frame[position++] =
    static_cast<uint8_t>(
      ssid.length()
    );

  memcpy(
    frame + position,
    ssid.c_str(),
    ssid.length()
  );

  position += ssid.length();

  // Supported rates.
  const uint8_t rates[] = {
    0x01, 0x08,
    0x82, 0x84,
    0x8b, 0x96,
    0x0c, 0x12,
    0x18, 0x24
  };

  memcpy(
    frame + position,
    rates,
    sizeof(rates)
  );

  position += sizeof(rates);

  // DS parameter set.
  frame[position++] = 0x03;
  frame[position++] = 0x01;
  frame[position++] = beaconChannel;

  esp_wifi_80211_tx(
    WIFI_IF_AP,
    frame,
    position,
    false
  );
}

void loadWifiSpamPresets() {
  beaconSsids.clear();

  for (size_t i = 0; i < WIFI_SPAM_SSID_COUNT; i++) {
    String ssid = WIFI_SPAM_SSIDS[i];

    if (ssid.length() > 0 && ssid.length() <= 32) {
      beaconSsids.push_back(ssid);
    }
  }

  Serial.printf(
    "Loaded %u Wi-Fi spam lab preset(s).\n",
    static_cast<unsigned>(beaconSsids.size())
  );
}

void startBeaconLab(
  uint8_t seconds
) {
  if (beaconSsids.empty()) {
    Serial.println(
      "Add SSIDs first:"
    );

    Serial.println(
      "wifi beacon add <ssid>"
    );

    return;
  }

  if (
    seconds == 0 ||
    seconds > MAX_WIFI_SPAM_DURATION_SECONDS
  ) {
    seconds = MAX_WIFI_SPAM_DURATION_SECONDS;
  }

  stopAll();

  currentMode =
    Mode::BEACON_LAB;

  WiFi.mode(WIFI_AP);

  bool started =
    WiFi.softAP(
      "WirelessLab32-Beacon",
      "WirelessLab32!",
      beaconChannel,
      true,
      1
    );

  if (!started) {
    Serial.println(
      "Could not initialize Wi-Fi beacon lab."
    );

    currentMode = Mode::IDLE;
    return;
  }

  esp_wifi_set_channel(
    beaconChannel,
    WIFI_SECOND_CHAN_NONE
  );

  beaconStopAt =
    millis() +
    static_cast<uint32_t>(
      seconds
    ) * 1000UL;

  Serial.println(
    "Beacon lab started."
  );

  Serial.printf(
    "Channel: %u\n",
    beaconChannel
  );

  Serial.printf(
    "Duration: %u seconds\n",
    seconds
  );

  Serial.printf(
    "SSID count: %u\n",
    static_cast<unsigned>(
      beaconSsids.size()
    )
  );
}

void serviceBeaconLab() {
  if (
    currentMode !=
    Mode::BEACON_LAB
  ) {
    return;
  }

  if (
    beaconStopAt != 0 &&
    static_cast<int32_t>(
      millis() - beaconStopAt
    ) >= 0
  ) {
    Serial.println();
    Serial.println(
      "Beacon lab timeout reached."
    );

    stopAll();
    printPrompt();

    return;
  }

  static uint32_t lastTransmission = 0;

  if (
    millis() -
    lastTransmission <
    120
  ) {
    return;
  }

  lastTransmission =
    millis();

  for (
    const String &ssid :
    beaconSsids
  ) {
    sendBeaconFrame(ssid);
  }
}

// ============================================================
// Captive portal lab
// ============================================================

String portalPage() {
  return R"HTML(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8">

  <meta
    name="viewport"
    content="width=device-width,initial-scale=1"
  >

  <title>WirelessLab32 Portal Lab</title>

  <style>
    body {
      font-family: system-ui, sans-serif;
      max-width: 680px;
      margin: 3rem auto;
      padding: 0 1rem;
      line-height: 1.5;
    }

    .card {
      border: 1px solid #bbb;
      border-radius: 14px;
      padding: 1.4rem;
    }

    .brand {
      display: flex;
      align-items: center;
      gap: 0.8rem;
      margin-bottom: 1rem;
    }

    .brand svg {
      width: 64px;
      height: 64px;
      flex: 0 0 auto;
    }

    .brand h1 {
      margin: 0;
    }

    .warning {
      background: #fff4cc;
      border: 1px solid #d6aa00;
      border-radius: 10px;
      padding: 0.8rem;
    }

    input,
    button {
      width: 100%;
      box-sizing: border-box;
      padding: 0.8rem;
      margin: 0.35rem 0;
      border: 1px solid #bbb;
      border-radius: 10px;
    }

    button {
      font-weight: 700;
      cursor: pointer;
    }

    code {
      background: #eee;
      padding: 0.15rem 0.35rem;
      border-radius: 5px;
    }
  </style>
</head>

<body>
  <div class="card">
    <div class="brand">
      <svg viewBox="0 0 64 64" role="img" aria-label="WirelessLab32 logo">
        <rect width="64" height="64" rx="14" fill="#123a63"/>
        <circle cx="32" cy="43" r="4" fill="#56d6ff"/>
        <path d="M22 34a14 14 0 0 1 20 0" fill="none" stroke="#56d6ff" stroke-width="4" stroke-linecap="round"/>
        <path d="M14 25a25 25 0 0 1 36 0" fill="none" stroke="#fff" stroke-width="4" stroke-linecap="round"/>
        <path d="M32 12v6M29 15h6" stroke="#fff" stroke-width="3" stroke-linecap="round"/>
      </svg>
      <h1>WirelessLab32 Portal Lab</h1>
    </div>

    <p class="warning">
      <strong>Training environment.</strong>
      Do not enter real credentials.
    </p>

    <p>
      Use the classroom username and any fictional password:
    </p>

    <p>
      Username:
      <code>student</code>
      <br>

      Password:
      <code>choose any training password</code>
    </p>

    <form
      method="post"
      action="/login"
      autocomplete="off"
    >
      <label for="username">
        Username
      </label>

      <input
        id="username"
        name="username"
        maxlength="32"
        required
      >

      <label for="password">
        Password
      </label>

      <input
        id="password"
        name="password"
        type="password"
        maxlength="64"
        required
      >

      <button type="submit">
        Sign in to training portal
      </button>
    </form>
  </div>
</body>
</html>
)HTML";
}

