cpereir89/esp32_wirelesslab/WirelessLab_ESP32/WirelessLab_ESP32.ino
    startBeaconLab(
      seconds
    );
  }

  else if (
    command ==
    "wifi spam load"
  ) {
    loadWifiSpamPresets();
  }

  else if (
    command.startsWith(
      "wifi spam start"
    )
  ) {
    String argument =
      command.substring(
        String("wifi spam start").length()
      );

    argument.trim();

    int requestedSeconds =
      argument.length() ? argument.toInt() : 10;

    if (beaconSsids.empty()) {
      loadWifiSpamPresets();
    }

    startBeaconLab(
      static_cast<uint8_t>(requestedSeconds)
    );
  }

  else if (
    command.startsWith(
      "portal start"
    )
  ) {
    String ssid =
      command.substring(
        String(
          "portal start"
        ).length()
      );

    ssid.trim();

    startPortal(ssid);
  }

  else if (
    command ==
    "portal stop"
  ) {
    stopAll();
  }

  else if (
    command ==
    "ble mode"
  ) {
    enterBleSerialMode();
  }

  else if (
    command ==
    "ble scan"
  ) {
    runBleScan();
  }

  else if (
    command ==
    "ble list"
  ) {
    printBleDevices();
  }

  else if (
    command ==
    "ble advertise start"
  ) {
    startBleAdvertising();
  }

  else if (
    command.startsWith(
      "ble advertise start "
    )
  ) {
    /*
      Por estabilidad, el nombre indicado por el usuario
      se ignora temporalmente. El nombre anunciado será
      siempre WirelessLab32.
    */

    String requestedName =
      command.substring(
        String(
          "ble advertise start "
        ).length()
      );

    requestedName.trim();

    Serial.printf(
      "Requested name '%s' ignored during stability testing.\n",
      requestedName.c_str()
    );

    startBleAdvertising();
  }

  else if (
    command ==
    "ble advertise stop"
  ) {
    stopBleAdvertising();
  }

  else if (
    command.startsWith(
      "ble spam start"
    )
  ) {
    String argument =
      command.substring(
        String("ble spam start").length()
      );

    argument.trim();

    int requestedSeconds =
      argument.length() ? argument.toInt() : 10;

    startBleSpamLab(
      static_cast<uint8_t>(requestedSeconds)
    );
  }

  else if (
    command ==
    "ble spam stop"
  ) {
    stopBleAdvertising();
  }

  else if (
    command ==
    "ble spam load"
  ) {
    printBleSpamPresets();
  }

  else if (
    command ==
    "ble spam status"
  ) {
    Serial.printf(
      "BLE spam lab: %s\nPresets: %u\n",
      bleSpamActive ? "active" : "inactive",
      static_cast<unsigned>(BLE_SPAM_PRESET_COUNT)
    );
  }

  else if (
    command ==
    "ble bluesnarf demo"
  ) {
    startBlueSnarfDemo();
  }

  else if (
    command ==
    "ble bluejack demo"
  ) {
    startBluejackingDemo();
  }

  else if (
    command.startsWith(
      "ble bluejack send "
    )
  ) {
    String message =
      command.substring(
        String("ble bluejack send ").length()
      );

    sendBluejackDemoMessage(message);
  }

  else if (
    command ==
    "ble exit"
  ) {
    stopBleOperations();

    currentMode =
      Mode::IDLE;

    Serial.println(
      "Exited BLE mode."
    );
  }

  else {
    Serial.println(
      "Unknown command. Type: help"
    );
  }
}

// ============================================================
// Serial handling
// ============================================================

void serviceSerial() {
  while (Serial.available()) {
    char character =
      static_cast<char>(
        Serial.read()
      );

    if (character == '\r') {
      continue;
    }

    if (character == '\n') {
      Serial.println();

      String command =
        serialBuffer;

      serialBuffer = "";

      handleCommand(
        command
      );

      printPrompt();
    }

    else if (
      character == 8 ||
      character == 127
    ) {
      if (serialBuffer.length()) {
        serialBuffer.remove(
          serialBuffer.length() - 1
        );

        Serial.print(
          "\b \b"
        );
      }
    }

    else if (
      isPrintable(character)
    ) {
      serialBuffer +=
        character;

      Serial.write(
        character
      );
    }
  }
}

// ============================================================
// Arduino lifecycle
// ============================================================

void setup() {
  Serial.begin(115200);

  delay(500);

  WiFi.mode(WIFI_OFF);

  Serial.println();
  Serial.println("XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX");
  Serial.println("X                                 X");
  Serial.println("X  ESP 32 - Wireless Hacking Lab  X");
  Serial.println("X                                 X");
  Serial.println("XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX");
  Serial.printf("Firmware: WirelessLab32 v%s\n", FW_VERSION);

  Serial.println(
    "Type: help"
  );

  printPrompt();
}

void loop() {
  serviceSerial();
  serviceBeaconLab();
  serviceBleAdvertisingLab();

  if (
    currentMode ==
    Mode::PORTAL
  ) {
    dnsServer.processNextRequest();
    webServer.handleClient();
  }

  delay(2);
}
